In [19]:
# dictionary of lists
topnames = {'year': [2018,2018,2017,2017,2016,2016],
	    'sex': ['Male','Female','Male','Female','Male','Female'],
	    'name': ['Liam','Emma','Liam','Emma','Noah','Emma'],
	    'count': [19837,18688,18798,19800,19117,19496]}

# print the entire row with row_index = 3
topnames

{'year': [2018, 2018, 2017, 2017, 2016, 2016],
 'sex': ['Male', 'Female', 'Male', 'Female', 'Male', 'Female'],
 'name': ['Liam', 'Emma', 'Liam', 'Emma', 'Noah', 'Emma'],
 'count': [19837, 18688, 18798, 19800, 19117, 19496]}

In [4]:
print(topnames['year'][3], topnames['sex'][3], \
      topnames['name'][3], topnames['count'][3])

2017 Female Emma 19800

In [5]:
topnames = [[2018, 'Male', 'Liam', 19837],
	    [2018,'Female', 'Emma', 18688],
	    [2017, 'Male', 'Liam', 18798],
	    [2017,'Female', 'Emma', 19800],
	    [2016,'Male', 'Noah', 19117],
	    [2016,'Female', 'Emma', 19496]]
columns = ['year', 'sex', 'name', 'count']
# print he entire column with col_index = 3
topnames

[[2018, 'Male', 'Liam', 19837],
 [2018, 'Female', 'Emma', 18688],
 [2017, 'Male', 'Liam', 18798],
 [2017, 'Female', 'Emma', 19800],
 [2016, 'Male', 'Noah', 19117],
 [2016, 'Female', 'Emma', 19496]]

In [6]:
print(topnames[0][3], topnames[1][3], topnames[2][3], topnames[3][3], topnames[4][3], topnames[5][3])

19837 18688 18798 19800 19117 19496

In [12]:
pip install pandas

Requirement already satisfied: pandas in ./anaconda3/lib/python3.11/site-packages (1.5.3)
Requirement already satisfied: python-dateutil>=2.8.1 in ./anaconda3/lib/python3.11/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in ./anaconda3/lib/python3.11/site-packages (from pandas) (2022.7)
Requirement already satisfied: numpy>=1.21.0 in ./anaconda3/lib/python3.11/site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in ./anaconda3/lib/python3.11/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd

In [4]:
data = pd.Series([10,30,-6,9],index=['obj1','obj2','obj3','obj4'])
print(data)

obj1    10
obj2    30
obj3    -6
obj4     9
dtype: int64

In [5]:
data[0]

10

In [6]:
data['obj1']

10

In [8]:
population_dict = {'California':38000000,
                   'Texas': 26000000}
population = pd.Series(population_dict)
print(population)

California    38000000
Texas         26000000
dtype: int64

In [10]:
population['California']

38000000

In [13]:
data.mean()

10.75

In [14]:
data.max()

30

In [15]:
data.std()

14.773286702694158

In [18]:
# data.sqrt() # does not work

import numpy as np
np.sqrt(data)

/Users/bilene/anaconda3/lib/python3.11/site-packages/pandas/core/arraylike.py:402: RuntimeWarning: invalid value encountered in sqrt
  result = getattr(ufunc, method)(*inputs, **kwargs)

obj1    3.162278
obj2    5.477226
obj3         NaN
obj4    3.000000
dtype: float64

In [26]:
# create a topnames df
df = pd.DataFrame(topnames)
df

   year     sex  name  count
0  2018    Male  Liam  19837
1  2018  Female  Emma  18688
2  2017    Male  Liam  18798
3  2017  Female  Emma  19800
4  2016    Male  Noah  19117
5  2016  Female  Emma  19496

In [29]:
# checks each column's data type
print(df.dtypes)
print(df.shape)
print(df.columns)
print(df.index)

year      int64
sex      object
name     object
count     int64
dtype: object
(6, 4)
Index(['year', 'sex', 'name', 'count'], dtype='object')
RangeIndex(start=0, stop=6, step=1)

In [31]:
# read a csv file in Pandas
df = pd.read_csv('https://raw.githubusercontent.com/ernbilen/Data200_Fall23/main/data/gapminder.csv')
df

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [39]:
print(df.shape)
print(df.head())
print(df.info())
print(df.describe())

(1704, 6)
       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   country    1704 non-null   object
 1   continent  1704 non-null   object
 2   year       1704 non-null   int64
 3   lifeExp    1704 non-null   float64
 4   pop        1704 non-null   int64
 5   gdpPercap  1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB
None
             year      lifeExp           pop      gdpPercap
count  1704.00000  1704.000000  1.704000e+03    1704.000000
mean   1979.50000    59.474439  2.960121e+07    7215.327081
std      17.26533    12.917107  1.061579e+08    9857.454543
min    1952.00000    23.599000  6.001100e+04     241.165876
25%    1965.75000    48.198000  2.793664e+06    1202.060309
50%    1979.50000    60.712500  7.023596e+06    3531.846988
75%    1993.25000    70.845500  1.958522e+07    9325.462346
max    2007.00000    82.603000  1.318683e+09  113523.132900

In [41]:
dataDoL={'name':['Bella','Charlie','Lucy','Coooper','Max','Stella','Bernie'], 
         'breed':['Labrador','Poodle','ChowChow','Schnauzer','Labrador','Chihuahua','St.Bernard'],
         'color': ['Brown','Black','Brown','Gray','Black','Tan','White'], 
         'height_cm':[56,43,46,49,59,18,77], 'weight_kg':[24,24,24,17,29,2,74], 
         'date_of_birth':['2013-07-01','2016-09-16','2014-08-25','2011-12-11','2017-01-28',\
                          '2015-04-20', '2018-02-27']}

In [42]:
df = pd.DataFrame(dataDoL)
df

      name       breed  color  height_cm  weight_kg date_of_birth
0    Bella    Labrador  Brown         56         24    2013-07-01
1  Charlie      Poodle  Black         43         24    2016-09-16
2     Lucy    ChowChow  Brown         46         24    2014-08-25
3  Coooper   Schnauzer   Gray         49         17    2011-12-11
4      Max    Labrador  Black         59         29    2017-01-28
5   Stella   Chihuahua    Tan         18          2    2015-04-20
6   Bernie  St.Bernard  White         77         74    2018-02-27

In [43]:
df['name']

0      Bella
1    Charlie
2       Lucy
3    Coooper
4        Max
5     Stella
6     Bernie
Name: name, dtype: object

In [44]:
df[['height_cm','breed']]

   height_cm       breed
0         56    Labrador
1         43      Poodle
2         46    ChowChow
3         49   Schnauzer
4         59    Labrador
5         18   Chihuahua
6         77  St.Bernard

In [45]:
df[df['height_cm']>50]

     name       breed  color  height_cm  weight_kg date_of_birth
0   Bella    Labrador  Brown         56         24    2013-07-01
4     Max    Labrador  Black         59         29    2017-01-28
6  Bernie  St.Bernard  White         77         74    2018-02-27

In [47]:
df[df['breed']=='Labrador']

    name     breed  color  height_cm  weight_kg date_of_birth
0  Bella  Labrador  Brown         56         24    2013-07-01
4    Max  Labrador  Black         59         29    2017-01-28

In [57]:
# general way of selecting a column
#df['breed']

# shortcut, dot method. Caveat can't handle whitespace in col name
#df['breed']

In [60]:
# filtering based on date
df[df['date_of_birth'] > '2015-01-01']

      name       breed  color  height_cm  weight_kg date_of_birth
1  Charlie      Poodle  Black         43         24    2016-09-16
4      Max    Labrador  Black         59         29    2017-01-28
5   Stella   Chihuahua    Tan         18          2    2015-04-20
6   Bernie  St.Bernard  White         77         74    2018-02-27